#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Дана строка. Удалить из нее все пробелы.

s = input("Введите предложение ")
s = ''.join(s.split())
print(s)
